/** Задача #1
 *
 * Игра в пятнашки — популярная головоломка, придуманная в 1878 году Ноем Чепмэном.
 * Представляет собой набор одинаковых квадратных костяшек с нанесёнными числами, заключённых
 * в квадратную коробку.Длина стороны коробки в четыре раза больше длины стороны костяшек для
 * набора из 15 элементов, соответственно в коробке остаётся незаполненным одно квадратное поле.
 * Цель игры — перемещая костяшки по коробке, добиться упорядочивания их по номерам,
 * желательно сделав как можно меньше перемещений.
 *
 * Подсказки:
 * - Достаточно повесить событие на всю таблицу и использовать возможности делегирования событий
 * - Используйте дополнительную навигацию доступную в таблицах: rows, cells.
 * - У cell есть свойство cellIndex у row есть свойство rowIndex
 */
export function onTableClick(e) {
  /** Ваш код */
}
