/**
 * Задача #1
 *
 * Реализуйте и экспортируйте по умолчанию функцию search,
 * которая принимает на вход document и имя тега, а возвращает массив из всех элементов,
 * соответствующих этому тегу. (без использования getElementsByTagName)
 */
export function search(element, tagName = '') {
  /** Ваш код */
}

/**
 * Задача #2
 *
 * Реализуйте функцию normalize, которая нормализует имена классов для всех элементов на странице.
 * В данном случае это означает, что происходит преобразование всех классов, написанных с использованием kebab нотации,
 * в camelCase нотацию: text-center => textCenter
 *
 * Самый простой способ найти все элементы в документе – document.body.getElementsByTagName('*')
 */
export function normalize(localDocument) {
  /** Ваш код */
}
