/**
 * Задача #1
 *
 * Сверстать форму с полем для ввода и кнопкой submit. В поле ввода необходимо ввести любой никнейм,
 * после подтверждения формы отправить запрос на api.github (https://api.github.com/users/{nickname})
 * на получение юзера, если юзер с таким никнеймом существует, показать его аватар,
 * иначе вывести ошибку, что такого пользователя не существует.
 * Во время выполнения запроса показывать лоадер.
 */
export function getUser() {
  /** Ваш код */
}

export function showUserAvatar() {
  /** Ваш код */
}
