/**
 * Задача #1
 *
 * Сверстать форму с полем для ввода и кнопкой submit. В поле ввода необходимо ввести любой никнейм,
 * после подтверждения формы отправить запрос на api.github (https://api.github.com/users/{nickname})
 * на получение юзера, если юзер с таким никнеймом существует, показать его аватар,
 * иначе вывести ошибку, что такого пользователя не существует.
 */

/** Ваш код */


/**
 * Задача #2
 *
 * Есть два гитхаб юзера, необходимо в два параллельных GET запроса (https://api.github.com/users/{nickname})
 * получить их  и вывести в консоль.
 */

/** Ваш код */


/**
 * Задача #3
 *
 * Необходимо последовательно отправить POST запрос с какими-то JSON данными на  https://api.myjson.com/bins,
 * а затем отправить GET запрос на роут, который вернулся в ответе от предыдущего запроса и вывести данные в консоль.
 */

/** Ваш код */
